## dev: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 46 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  NAME                                  |
|--------|------------------------------------------------------------------------|
| add    | `aws_api_gateway_base_path_mapping.api`                                |
|        | `aws_api_gateway_base_path_mapping.api_lambda`                         |
|        | `aws_api_gateway_base_path_mapping.api_lambda_alt`                     |
|        | `aws_api_gateway_deployment.api`                                       |
|        | `aws_api_gateway_domain_name.alt_api_lambda`                           |
|        | `aws_api_gateway_domain_name.api`                                      |
|        | `aws_api_gateway_domain_name.api_lambda`                               |
|        | `aws_api_gateway_integration.integration`                              |
|        | `aws_api_gateway_integration.root_integration`                         |
|        | `aws_api_gateway_integration_response.integration_response`            |
|        | `aws_api_gateway_method.method`                                        |
|        | `aws_api_gateway_method.root_method`                                   |
|        | `aws_api_gateway_method_response.api_response_200`                     |
|        | `aws_api_gateway_method_settings.all`                                  |
|        | `aws_api_gateway_method_settings.api_settings`                         |
|        | `aws_api_gateway_resource.resource`                                    |
|        | `aws_api_gateway_rest_api.api`                                         |
|        | `aws_api_gateway_stage.api`                                            |
|        | `aws_appautoscaling_scheduled_action.api-5pm`                          |
|        | `aws_appautoscaling_scheduled_action.api-noon`                         |
|        | `aws_appautoscaling_target.api`                                        |
|        | `aws_cloudwatch_log_group.api_gateway_log_group`                       |
|        | `aws_cloudwatch_query_definition.services-over-daily-rate-limit`       |
|        | `aws_iam_group.ecr`                                                    |
|        | `aws_iam_group_membership.ecr`                                         |
|        | `aws_iam_group_policy_attachment.ecr`                                  |
|        | `aws_iam_policy.api`                                                   |
|        | `aws_iam_policy.ecr`                                                   |
|        | `aws_iam_role.api`                                                     |
|        | `aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole`       |
|        | `aws_iam_role_policy_attachment.api`                                   |
|        | `aws_iam_role_policy_attachment.lambda_insights`                       |
|        | `aws_iam_user.ecr-user`                                                |
|        | `aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs`    |
|        | `aws_lambda_alias.api_latest`                                          |
|        | `aws_lambda_function.api`                                              |
|        | `aws_lambda_permission.api_1`                                          |
|        | `aws_lambda_provisioned_concurrency_config.api`                        |
|        | `aws_route53_record.api-lambda-notification-A`                         |
|        | `aws_route53_record.api-notification-alt-A[0]`                         |
|        | `aws_route53_record.api-weighted-100-notification-A`                   |
|        | `aws_secretsmanager_secret.new-relic-license-key`                      |
|        | `aws_secretsmanager_secret_version.new-relic-license-key`              |
|        | `aws_wafv2_web_acl.api_lambda`                                         |
|        | `aws_wafv2_web_acl_association.waf_association`                        |
|        | `aws_wafv2_web_acl_logging_configuration.firehose-api-lambda-waf-logs` |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/11145958143).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "api_policies" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForlayer",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecr:ca-central-1:800095993820:repository/notify/api-lambda",
            ]
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::notification-canada-ca-dev-csv-upload/*",
            ]
        }
      + statement {
          + actions   = [
              + "securityhub:BatchImportFindings",
              + "sns:Publish",
              + "sqs:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:DescribeParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = (sensitive value)
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:GetMetricData",
              + "cloudwatch:GetMetricStatistics",
              + "cloudwatch:ListMetrics",
              + "config:BatchGetResourceConfig",
              + "config:ListDiscoveredResources",
              + "lambda:GetAccountSettings",
              + "lambda:ListAliases",
              + "lambda:ListEventSourceMappings",
              + "lambda:ListFunctions",
              + "lambda:ListTags",
              + "tag:GetResources",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # data.aws_iam_policy_document.ecr will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecr" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "GetAuthorizationToken"
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:CompleteLayerUpload",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:InitiateLayerUpload",
              + "ecr:PutImage",
              + "ecr:UploadLayerPart",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecr:ca-central-1:800095993820:repository/notify/api-lambda",
            ]
          + sid       = "AllowPushPull"
        }
      + statement {
          + actions   = [
              + "lambda:GetAlias",
              + "lambda:GetFunction",
              + "lambda:GetFunctionConfiguration",
              + "lambda:ListAliases",
              + "lambda:ListVersionsByFunction",
              + "lambda:PublishVersion",
              + "lambda:UpdateAlias",
              + "lambda:UpdateFunctionCode",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "PermissionsToUpdateFunction"
        }
      + statement {
          + actions   = [
              + "lambda:GetLayerVersion",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*",
            ]
          + sid       = "PermissionsToDownloadNewRelicLambdaLayers"
        }
    }

  # aws_api_gateway_base_path_mapping.api will be created
  + resource "aws_api_gateway_base_path_mapping" "api" {
      + api_id      = (known after apply)
      + domain_name = "api.dev.notification.cdssandbox.xyz"
      + id          = (known after apply)
      + stage_name  = "v1"
    }

  # aws_api_gateway_base_path_mapping.api_lambda will be created
  + resource "aws_api_gateway_base_path_mapping" "api_lambda" {
      + api_id      = (known after apply)
      + domain_name = "api-lambda.dev.notification.cdssandbox.xyz"
      + id          = (known after apply)
      + stage_name  = "v1"
    }

  # aws_api_gateway_base_path_mapping.api_lambda_alt will be created
  + resource "aws_api_gateway_base_path_mapping" "api_lambda_alt" {
      + api_id      = (known after apply)
      + domain_name = "api.alpha.dev.notification.cdssandbox.xyz"
      + id          = (known after apply)
      + stage_name  = "v1"
    }

  # aws_api_gateway_deployment.api will be created
  + resource "aws_api_gateway_deployment" "api" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = {
          + "redeployment" = "c1c3df7a50ee1a689772094fb67e86de0dd192aa"
        }
    }

  # aws_api_gateway_domain_name.alt_api_lambda will be created
  + resource "aws_api_gateway_domain_name" "alt_api_lambda" {
      + arn                                    = (known after apply)
      + certificate_upload_date                = (known after apply)
      + cloudfront_domain_name                 = (known after apply)
      + cloudfront_zone_id                     = (known after apply)
      + domain_name                            = "api.alpha.dev.notification.cdssandbox.xyz"
      + id                                     = (known after apply)
      + ownership_verification_certificate_arn = (known after apply)
      + regional_certificate_arn               = "arn:aws:acm:ca-central-1:800095993820:certificate/5fcd14c0-4d69-4a9b-b243-a9ab57b36f61"
      + regional_domain_name                   = (known after apply)
      + regional_zone_id                       = (known after apply)
      + security_policy                        = "TLS_1_2"
      + tags_all                               = (known after apply)

      + endpoint_configuration {
          + types = [
              + "REGIONAL",
            ]
        }
    }

  # aws_api_gateway_domain_name.api will be created
  + resource "aws_api_gateway_domain_name" "api" {
      + arn                                    = (known after apply)
      + certificate_upload_date                = (known after apply)
      + cloudfront_domain_name                 = (known after apply)
      + cloudfront_zone_id                     = (known after apply)
      + domain_name                            = "api.dev.notification.cdssandbox.xyz"
      + id                                     = (known after apply)
      + ownership_verification_certificate_arn = (known after apply)
      + regional_certificate_arn               = "arn:aws:acm:ca-central-1:800095993820:certificate/4a6262c9-bd08-4fc8-a58b-b6c236d94872"
      + regional_domain_name                   = (known after apply)
      + regional_zone_id                       = (known after apply)
      + security_policy                        = "TLS_1_2"
      + tags_all                               = (known after apply)

      + endpoint_configuration {
          + types = [
              + "REGIONAL",
            ]
        }
    }

  # aws_api_gateway_domain_name.api_lambda will be created
  + resource "aws_api_gateway_domain_name" "api_lambda" {
      + arn                                    = (known after apply)
      + certificate_upload_date                = (known after apply)
      + cloudfront_domain_name                 = (known after apply)
      + cloudfront_zone_id                     = (known after apply)
      + domain_name                            = "api-lambda.dev.notification.cdssandbox.xyz"
      + id                                     = (known after apply)
      + ownership_verification_certificate_arn = (known after apply)
      + regional_certificate_arn               = "arn:aws:acm:ca-central-1:800095993820:certificate/4a6262c9-bd08-4fc8-a58b-b6c236d94872"
      + regional_domain_name                   = (known after apply)
      + regional_zone_id                       = (known after apply)
      + security_policy                        = "TLS_1_2"
      + tags_all                               = (known after apply)

      + endpoint_configuration {
          + types = [
              + "REGIONAL",
            ]
        }
    }

  # aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + request_parameters      = {
          + "integration.request.path.proxy" = "method.request.path.proxy"
        }
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration.root_integration will be created
  + resource "aws_api_gateway_integration" "root_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + request_parameters      = {
          + "integration.request.path.proxy" = "method.request.path.proxy"
        }
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_integration_response.integration_response will be created
  + resource "aws_api_gateway_integration_response" "integration_response" {
      + http_method        = "ANY"
      + id                 = (known after apply)
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # aws_api_gateway_method.method will be created
  + resource "aws_api_gateway_method" "method" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "ANY"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.proxy" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # aws_api_gateway_method.root_method will be created
  + resource "aws_api_gateway_method" "root_method" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.proxy" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # aws_api_gateway_method_response.api_response_200 will be created
  + resource "aws_api_gateway_method_response" "api_response_200" {
      + http_method     = "ANY"
      + id              = (known after apply)
      + resource_id     = (known after apply)
      + response_models = {
          + "application/json" = "Empty"
        }
      + rest_api_id     = (known after apply)
      + status_code     = "200"
    }

  # aws_api_gateway_method_settings.all will be created
  + resource "aws_api_gateway_method_settings" "all" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = (known after apply)
      + stage_name  = "v1"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = "ERROR"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # aws_api_gateway_method_settings.api_settings will be created
  + resource "aws_api_gateway_method_settings" "api_settings" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = (known after apply)
      + stage_name  = "v1"

      + settings {
          + cache_data_encrypted                       = true
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = true
          + data_trace_enabled                         = true
          + logging_level                              = "ERROR"
          + metrics_enabled                            = true
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = -1
          + throttling_rate_limit                      = -1
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # aws_api_gateway_resource.resource will be created
  + resource "aws_api_gateway_resource" "resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{proxy+}"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Proxy to handle requests to our API"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "api-lambda"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_api_gateway_stage.api will be created
  + resource "aws_api_gateway_stage" "api" {
      + arn                  = (known after apply)
      + deployment_id        = (known after apply)
      + execution_arn        = (known after apply)
      + id                   = (known after apply)
      + invoke_url           = (known after apply)
      + rest_api_id          = (known after apply)
      + stage_name           = "v1"
      + tags_all             = (known after apply)
      + web_acl_arn          = (known after apply)
      + xray_tracing_enabled = true

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + caller         = "$context.identity.caller"
                  + httpMethod     = "$context.httpMethod"
                  + ip             = "$context.identity.sourceIp"
                  + requestId      = "$context.requestId"
                  + requestTime    = "$context.requestTime"
                  + resourcePath   = "$context.resourcePath"
                  + responseLength = "$context.responseLength"
                  + status         = "$context.status"
                }
            )
        }
    }

  # aws_appautoscaling_scheduled_action.api-5pm will be created
  + resource "aws_appautoscaling_scheduled_action" "api-5pm" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "api-5pm"
      + resource_id        = "function:api-lambda:latest"
      + scalable_dimension = "lambda:function:ProvisionedConcurrency"
      + schedule           = "cron(0 17 * * ? *)"
      + service_namespace  = "lambda"
      + timezone           = "America/Toronto"

      + scalable_target_action {
          + max_capacity = "5"
          + min_capacity = "1"
        }
    }

  # aws_appautoscaling_scheduled_action.api-noon will be created
  + resource "aws_appautoscaling_scheduled_action" "api-noon" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "api-noon"
      + resource_id        = "function:api-lambda:latest"
      + scalable_dimension = "lambda:function:ProvisionedConcurrency"
      + schedule           = "cron(0 12 * * ? *)"
      + service_namespace  = "lambda"
      + timezone           = "America/Toronto"

      + scalable_target_action {
          + max_capacity = "10"
          + min_capacity = "1"
        }
    }

  # aws_appautoscaling_target.api will be created
  + resource "aws_appautoscaling_target" "api" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 10
      + min_capacity       = 1
      + resource_id        = "function:api-lambda:latest"
      + role_arn           = (known after apply)
      + scalable_dimension = "lambda:function:ProvisionedConcurrency"
      + service_namespace  = "lambda"
      + tags_all           = (known after apply)

      + suspended_state (known after apply)
    }

  # aws_cloudwatch_log_group.api_gateway_log_group will be created
  + resource "aws_cloudwatch_log_group" "api_gateway_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "api_gateway_log_group"
      + name_prefix       = (known after apply)
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Application" = "lambda"
          + "CostCenter"  = "notification-canada-ca-dev"
          + "Environment" = "dev"
        }
      + tags_all          = {
          + "Application" = "lambda"
          + "CostCenter"  = "notification-canada-ca-dev"
          + "Environment" = "dev"
        }
    }

  # aws_cloudwatch_query_definition.services-over-daily-rate-limit will be created
  + resource "aws_cloudwatch_query_definition" "services-over-daily-rate-limit" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/api-lambda",
          + "/aws/containerinsights/notification-canada-ca-dev-eks-cluster/application",
        ]
      + name                = "API / Services going over daily rate limits"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            filter (ispresent(application) or ispresent(kubernetes.host)) and @message like /has been rate limited/
            | parse @message /service (?<service>.*?) has been rate limited for (?<limit_type>..........).*/
            | stats count(*) by service, limit_type
        EOT
    }

  # aws_iam_group.ecr will be created
  + resource "aws_iam_group" "ecr" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "ecr-api-lambda-group"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # aws_iam_group_membership.ecr will be created
  + resource "aws_iam_group_membership" "ecr" {
      + group = "ecr-api-lambda-group"
      + id    = (known after apply)
      + name  = "ecr-group-membership"
      + users = [
          + "ecr-user",
        ]
    }

  # aws_iam_group_policy_attachment.ecr will be created
  + resource "aws_iam_group_policy_attachment" "ecr" {
      + group      = "ecr-api-lambda-group"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # aws_iam_policy.api will be created
  + resource "aws_iam_policy" "api" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "notify-api"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.ecr will be created
  + resource "aws_iam_policy" "ecr" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow push to only api-lambda ECR"
      + id               = (known after apply)
      + name             = "ecr-api-lambda-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.api will be created
  + resource "aws_iam_role" "api" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "notify-api"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "notify-api"
    }

  # aws_iam_role_policy_attachment.api will be created
  + resource "aws_iam_role_policy_attachment" "api" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "notify-api"
    }

  # aws_iam_role_policy_attachment.lambda_insights will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "notify-api"
    }

  # aws_iam_user.ecr-user will be created
  + resource "aws_iam_user" "ecr-user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "ecr-user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs will be created
  + resource "aws_kinesis_firehose_delivery_stream" "firehose-api-lambda-waf-logs" {
      + arn            = (known after apply)
      + destination    = "extended_s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "aws-waf-logs-notification-canada-ca-api-lambda-waf"
      + tags           = {
          + "CostCenter" = "notification-canada-ca-dev"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCenter" = "notification-canada-ca-dev"
          + "Terraform"  = "true"
        }
      + version_id     = (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-800095993820"
          + buffering_interval = 300
          + buffering_size     = 5
          + compression_format = "GZIP"
          + custom_time_zone   = "UTC"
          + prefix             = (sensitive value)
          + role_arn           = "arn:aws:iam::800095993820:role/FirehoseWafLogs"
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options (known after apply)
        }

      + server_side_encryption {
          + enabled  = true
          + key_type = "AWS_OWNED_CMK"
        }
    }

  # aws_lambda_alias.api_latest will be created
  + resource "aws_lambda_alias" "api_latest" {
      + arn              = (known after apply)
      + description      = "The most recently deployed version of the API"
      + function_name    = (known after apply)
      + function_version = (known after apply)
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "latest"
    }

  # aws_lambda_function.api will be created
  + resource "aws_lambda_function" "api" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "api-lambda"
      + id                             = (known after apply)
      + image_uri                      = "800095993820.dkr.ecr.ca-central-1.amazonaws.com/notify/api-lambda:bootstrap"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = 850
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ADMIN_BASE_URL"                        = "https://dev.notification.cdssandbox.xyz"
              + "API_HOST_NAME"                         = "https://api.dev.notification.cdssandbox.xyz"
              + "AWS_XRAY_SDK_ENABLED"                  = "true"
              + "DOCUMENT_DOWNLOAD_API_HOST"            = "https://api.document.dev.notification.cdssandbox.xyz"
              + "FF_CLOUDWATCH_METRICS_ENABLED"         = "true"
              + "NEW_RELIC_ACCOUNT_ID"                  = (sensitive value)
              + "NEW_RELIC_APP_NAME"                    = "notification-lambda-api-dev"
              + "NEW_RELIC_CONFIG_FILE"                 = "/app/newrelic.ini"
              + "NEW_RELIC_DISTRIBUTED_TRACING_ENABLED" = "true"
              + "NEW_RELIC_ENVIRONMENT"                 = "dev"
              + "NEW_RELIC_EXTENSION_LOGS_ENABLED"      = "true"
              + "NEW_RELIC_LAMBDA_EXTENSION_ENABLED"    = "true"
              + "NEW_RELIC_LAMBDA_HANDLER"              = "application.handler"
              + "NOTIFICATION_QUEUE_PREFIX"             = "eks-notification-canada-ca"
              + "NOTIFY_EMAIL_DOMAIN"                   = "dev.notification.cdssandbox.xyz"
              + "NOTIFY_ENVIRONMENT"                    = "dev"
              + "REDIS_ENABLED"     ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.new-relic-license-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_lambda"]

34 tests, 19 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
